from selenium import webdriver
from selenium.webdriver.common.by import By
import time

try:
    browser = webdriver.Chrome()
    browser.get("http://suninjuly.github.io/huge_form.html")
    elements = browser.find_elements(By.TAG_NAME, "input")
    
    text = ["Текст 1", "Текст 2", "Текст 3", "Текст 4", "Текст 5", "Текст 6", "Текст 7", "Текст 8", "Текст 9", "Текст 10", "Текст 11", "Текст 12", "Текст 13", "Текст 14", "Текст 15", "Текст 16", "Текст 17", "Текст 18", "Текст 19", "Текст 20", "Текст 21", "Текст 22", "Текст 23", "Текст 24", "Текст 25", "Текст 26", "Текст 27", "Текст 28", "Текст 29", "Текст 30", "Текст 31", "Текст 32", "Текст 1", "Текст 2", "Текст 3", "Текст 4", "Текст 5", "Текст 6", "Текст 7", "Текст 8", "Текст 9", "Текст 10", "Текст 11", "Текст 12", "Текст 13", "Текст 14", "Текст 15", "Текст 16", "Текст 17", "Текст 18", "Текст 19", "Текст 20", "Текст 21", "Текст 22", "Текст 23", "Текст 24", "Текст 25", "Текст 26", "Текст 27", "Текст 28", "Текст 29", "Текст 30", "Текст 31", "Текст 32", "Текст 1", "Текст 2", "Текст 3", "Текст 4", "Текст 5", "Текст 6", "Текст 7", "Текст 8", "Текст 9", "Текст 10", "Текст 11", "Текст 12", "Текст 13", "Текст 14", "Текст 15", "Текст 16", "Текст 17", "Текст 18", "Текст 19", "Текст 20", "Текст 21", "Текст 22", "Текст 23", "Текст 24", "Текст 25", "Текст 26", "Текст 27", "Текст 28", "Текст 29", "Текст 30", "Текст 31", "Текст 32", "Текст 29", "Текст 30", "Текст 31", "Текст 32"]
    
    for i in range(len(elements)):
        elements[i].send_keys(text[i])

    button = browser.find_element(By.CSS_SELECTOR, "button.btn")
    button.click()

finally:
    # успеваем скопировать код за 30 секунд
    time.sleep(30)
    # закрываем браузер после всех манипуляций
    browser.quit()

# не забываем оставить пустую строку в конце файла